const ERR_MESSAGE = {
    // 10006: "请间隔60秒再发送验证码",
    10013: "无效token",
    10101: "没有权限",
    10103: "应用列表获取失败",
    10104: "用户已经存在",
    10106: "添加失败",
    10108: "更新失败",
    10109: "获取应用信息失败",
    10110: "应用信息不一致，没有权限",
    10111: "获取角色列表失败",
    10112: "管理员最多添加5个",
    10113: "删除失败",
    10114: "应用总数获取失败",
    10115: "参数不合法",
    // 10008: "验证码错误",
};

const ACCOUNT_ERR_MESSAGE = {
    10007: "手机号未注册",
    10009: "手机号不能超过16位",
    10011: "手机号或密码错误",
    10012: "手机号已注册",
    10102: "当前用户不存在",
};

const PWD_ERR_MESSAGE = {
    10010: "密码必须是6-16位，且包含字母和数字",
};

export { ERR_MESSAGE, ACCOUNT_ERR_MESSAGE, PWD_ERR_MESSAGE };
